frain1219/ZHIYUN_F100/SDK/APM32F10x_SDK_V2.0.0/Utilities/SVD/APM32F103x8.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RCM</name>
            <description>Reset and clock management unit</description>
            <groupName>RCM</groupName>
            <baseAddress>0x40021000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RCM</name>
                <description>RCM global interrupt</description>
                <value>5</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>Clock control register (RCM_CTRL)</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000083</resetValue>
                    <fields>
                        <field>
                            <name>HSIEN</name>
                            <description>Internal High Speed clock enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSIRDYFLG</name>
                            <description>Internal High Speed clock ready flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSITRIM</name>
                            <description>Internal High Speed clock trimming</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSICAL</name>
                            <description>Internal High Speed clock Calibration</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSEEN</name>
                            <description>External High Speed clock enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSERDYFLG</name>
                            <description>External High Speed clock ready flag</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSEBCFG</name>
                            <description>External High Speed clock Bypass</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CSSEN</name>
                            <description>Clock Security System enable</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLEN</name>
                            <description>PLL enable</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLRDYFLG</name>
                            <description>PLL clock ready flag</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG</name>
                    <displayName>CFG</displayName>
                    <description>Clock configuration register (RCM_CFGR)</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SCLKSEL</name>
                            <description>System clock Switch</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLKSELSTS</name>
                            <description>System Clock Switch Status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AHBPSC</name>
                            <description>AHB prescaler</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>APB1PSC</name>
                            <description>APB Low speed prescaler (APB1)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>APB2PSC</name>
                            <description>APB High speed prescaler (APB2)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADCPSC</name>
                            <description>ADC prescaler</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLSRCSEL</name>
                            <description>PLL entry clock source</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLHSEPSC</name>
                            <description>HSE divider for PLL entry</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLMULCFG</name>
                            <description>PLL Multiplication Factor</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBDPSC</name>
                            <description>USB OTG FS prescaler</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCOSEL</name>
                            <description>Microcontroller clock output</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FPUPSC</name>
                            <description>FPU Clock Prescaler Factor Configure</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT</name>
                    <displayName>INT</displayName>
                    <description>Clock interrupt control register (RCM_INT)</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LSIRDYFLG</name>
                            <description>LSI Ready Interrupt flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LSERDYFLG</name>
                            <description>LSE Ready Interrupt flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSIRDYFLG</name>
                            <description>HSI Ready Interrupt flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSERDYFLG</name>
                            <description>HSE Ready Interrupt flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLLRDYFLG</name>
                            <description>PLL Ready Interrupt flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CSSIF</name>
                            <description>Clock Security System Interrupt flag</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LSIRDYEN</name>
                            <description>LSI Ready Interrupt Enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSERDYEN</name>
                            <description>LSE Ready Interrupt Enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSIRDYEN</name>
                            <description>HSI Ready Interrupt Enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSERDYEN</name>
                            <description>HSE Ready Interrupt Enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLRDYEN</name>
                            <description>PLL Ready Interrupt Enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSIRDYCLR</name>
                            <description>LSI Ready Interrupt Clear</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>LSERDYCLR</name>
                            <description>LSE Ready Interrupt Clear</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>HSIRDYCLR</name>
                            <description>HSI Ready Interrupt Clear</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>HSERDYCLR</name>
                            <description>HSE Ready Interrupt Clear</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PLLRDYCLR</name>
                            <description>PLL Ready Interrupt Clear</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CSSCLR</name>
                            <description>Clock security system interrupt clear</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB2RST</name>
                    <displayName>APB2RST</displayName>
                    <description>APB2 peripheral reset register (RCM_APB2RST)</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000000000</resetValue>
                    <fields>
                        <field>
                            <name>AFIO</name>
                            <description>Alternate function I/O reset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA</name>
                            <description>IO port A reset</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB</name>
                            <description>IO port B reset</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC</name>
                            <description>IO port C reset</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD</name>
                            <description>IO port D reset</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PE</name>
                            <description>IO port E reset</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>



                        <field>
                            <name>ADC1</name>
                            <description>ADC 1 interface reset</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC2</name>
                            <description>ADC 2 interface reset</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR1</name>
                            <description>TMR1 timer reset</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI1</name>
                            <description>SPI 1 reset</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>

                        <field>
                            <name>USART1</name>
                            <description>USART1 reset</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>


                    </fields>
                </register>
                <register>
                    <name>APB1RST</name>
                    <displayName>APB1RST</displayName>
                    <description>APB1 peripheral reset register (RCM_APB1RST)</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMR2</name>
                            <description>Timer 2 reset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR3</name>
                            <description>Timer 3 reset</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR4</name>
                            <description>Timer 4 reset</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>



                        <field>
                            <name>WWDT</name>
                            <description>Window watchdog reset</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI2</name>
                            <description>SPI2 reset</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>

                        <field>
                            <name>USART2</name>
                            <description>USART 2 reset</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USART3</name>
                            <description>USART 3 reset</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>


