frain1219/ZHIYUN_F100/SDK/APM32F10x_SDK_V2.0.0/Utilities/SVD/APM32F103x8.svd
                        <field>
                            <name>I2C1</name>
                            <description>I2C1 reset</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C2</name>
                            <description>I2C2 reset</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBD</name>
                            <description>USB reset</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAN1</name>
                            <description>CAN1 reset</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAN2</name>
                            <description>CAN2 reset</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BAKP</name>
                            <description>Bakr interface reset</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PMU</name>
                            <description>Power interface reset</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>

                    </fields>
                </register>
                <register>
                    <name>AHBCLKEN</name>
                    <displayName>AHBCLKEN</displayName>
                    <description>AHB clock enable register (RCM_AHBCLKEN)</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000014</resetValue>
                    <fields>
                        <field>
                            <name>DMA1</name>
                            <description>DMA1 clock enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SRAM</name>
                            <description>SRAM interface clock enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>


                        <field>
                            <name>FPU</name>
                            <description>FPU clock Enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMC</name>
                            <description>FMC clock enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>QSPI</name>
                            <description>QSPI clock enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRC</name>
                            <description>CRC clock enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>


                    </fields>
                </register>
                <register>
                    <name>APB2CLKEN</name>
                    <displayName>APB2CLKEN</displayName>
                    <description>APB2 clock enable register (RCM_APB2CLKEN)</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AFIO</name>
                            <description>Alternate function I/O clock enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA</name>
                            <description>I/O port A clock enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB</name>
                            <description>I/O port B clock enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC</name>
                            <description>I/O port C clock enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD</name>
                            <description>I/O port D clock enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PE</name>
                            <description>I/O port E clock enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>


                        <field>
                            <name>ADC1</name>
                            <description>ADC 1 interface clock enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC2</name>
                            <description>ADC 2 interface clock enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR1</name>
                            <description>TMR1 Timer clock enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI1</name>
                            <description>SPI 1 clock enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>

                        <field>
                            <name>USART1</name>
                            <description>USART1 clock enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>

                    </fields>
                </register>
                <register>
                    <name>APB1CLKEN</name>
                    <displayName>APB1CLKEN</displayName>
                    <description>APB1 clock enable register (RCM_APB1CLKEN)</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMR2</name>
                            <description>Timer 2 clock enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR3</name>
                            <description>Timer 3 clock enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR4</name>
                            <description>Timer 4 clock enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>



                        <field>
                            <name>WWDT</name>
                            <description>Window watchdog clock enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI2</name>
                            <description>SPI 2 clock enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>

                        <field>
                            <name>USART2</name>
                            <description>USART 2 clock enable</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USART3</name>
                            <description>USART 3 clock enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>


                        <field>
                            <name>I2C1</name>
                            <description>I2C 1 clock enable</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C2</name>
                            <description>I2C 2 clock enable</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBD</name>
                            <description>USB clock enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAN1</name>
                            <description>CAN1 clock enable</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAN2</name>
                            <description>CAN2 clock enable</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BAKP</name>
                            <description>Bakr interface clock enable</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PMU</name>
                            <description>Power interface clock enable</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>

                    </fields>
                </register>
                <register>
                    <name>BDCTRL</name>
                    <displayName>BDCTRL</displayName>
                    <description>Bakr domain control register (RCM_BDCTRL)</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LSEEN</name>
                            <description>External Low Speed oscillator enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSERDYFLG</name>
                            <description>External Low Speed oscillator ready</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LSEBCFG</name>
                            <description>External Low Speed oscillator bypass</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCSRCSEL</name>
                            <description>RTC clock source selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCCLKEN</name>
                            <description>RTC clock enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BDRST</name>
                            <description>Bakr domain software reset</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSTS</name>
                    <displayName>CSTS</displayName>
                    <description>Control/status register (RCM_CSTS)</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0C000000</resetValue>
                    <fields>
                        <field>
                            <name>LSIEN</name>
                            <description>Internal low speed oscillator enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSIRDYFLG</name>
                            <description>Internal low speed oscillator ready</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSTFLGCLR</name>
                            <description>Remove reset flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NRSTFLG</name>
                            <description>PIN reset flag</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PODRSTFLG</name>
                            <description>POR/PDR reset flag</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWRSTFLG</name>
                            <description>Software reset flag</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IWDTRSTFLG</name>
                            <description>Independent watchdog reset flag</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WWDTRSTFLG</name>
                            <description>Window watchdog reset flag</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPWRRSTFLG</name>
                            <description>Low-power reset flag</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
